{
"_name_or_path": "liuhaotian/llava-v1.5-7b",
"architectures": [
"LISAForCausalLM"
],
"bos_token_id": 1,
"eos_token_id": 2,
"freeze_mm_mlp_adapter": true,
"freeze_mm_vision_resampler": false,
"hidden_act": "silu",
"hidden_size": 4096,
"image_aspect_ratio": "square",
"image_grid_pinpoints": null,
"initializer_range": 0.02,
"intermediate_size": 11008,
"max_length": 4096,
"max_position_embeddings": 4096,
"mm_hidden_size": 1024,
"mm_projector_type": "mlp2x_gelu",
"mm_resampler_type": null,
"mm_use_im_patch_token": false,
"mm_use_im_start_end": true,
"mm_vision_select_feature": "patch",
"mm_vision_select_layer": -2,
"mm_vision_tower": "openai/clip-vit-large-patch14-336",
"model_type": "llava",
"num_attention_heads": 32,
"num_hidden_layers": 32,
"num_key_value_heads": 32,
"out_dim": 256,
"pad_token_id": 0,
"pretrain_mm_mlp_adapter": null,
"pretraining_tp": 1,
"rms_norm_eps": 0.00001,
"rope_scaling": null,
"tie_word_embeddings": false,
"torch_dtype": "bfloat16",
"train_mask_decoder": true,
"transformers_version": "4.31.0",
"tune_mm_mlp_adapter": false,
"tune_mm_vision_resampler": false,
"unfreeze_mm_vision_tower": false,
"use_cache": false,
"use_mm_proj": true,
"vision_tower": "openai/clip-vit-large-patch14-336",
"vocab_size": 32001
}

